{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HTTP/1.1 200 OK\r",
      "\r\n",
      "Date: Sat, 24 Oct 2015 11:13:26 GMT\r",
      "\r\n",
      "Content-Type: application/json; charset=UTF-8\r",
      "\r\n",
      "Access-Control-Allow-Origin: *\r",
      "\r\n",
      "Content-Length: 730\r",
      "\r\n",
      "Server: Jetty(9.2.4.v20141103)\r",
      "\r\n",
      "\r",
      "\r\n",
      "{\r\n",
      "  \"extensions\" : { },\r\n",
      "  \"node\" : \"http://localhost:7474/db/data/node\",\r\n",
      "  \"node_index\" : \"http://localhost:7474/db/data/index/node\",\r\n",
      "  \"relationship_index\" : \"http://localhost:7474/db/data/index/relationship\",\r\n",
      "  \"extensions_info\" : \"http://localhost:7474/db/data/ext\",\r\n",
      "  \"relationship_types\" : \"http://localhost:7474/db/data/relationship/types\",\r\n",
      "  \"batch\" : \"http://localhost:7474/db/data/batch\",\r\n",
      "  \"cypher\" : \"http://localhost:7474/db/data/cypher\",\r\n",
      "  \"indexes\" : \"http://localhost:7474/db/data/schema/index\",\r\n",
      "  \"constraints\" : \"http://localhost:7474/db/data/schema/constraint\",\r\n",
      "  \"transaction\" : \"http://localhost:7474/db/data/transaction\",\r\n",
      "  \"node_labels\" : \"http://localhost:7474/db/data/labels\",\r\n",
      "  \"neo4j_version\" : \"2.3.0\"\r\n",
      "}"
     ]
    }
   ],
   "source": [
    "!curl -i http://localhost:7474/db/data/."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(<Node graph=u'http://localhost:7474/db/data/' ref=u'node/8' labels=set(['Person']) properties={'age': 24, 'name': u'Nicole'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/9' labels=set(['Person']) properties={'age': 20, 'name': u'Drew'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/10' labels=set(['Drink']) properties={'calories': 9000, 'name': u'Mountain Dew'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/11' labels=set(['Drink']) properties={'calories': 0, 'name': u'Coke Zero'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/12' labels=set(['Manufacturer']) properties={'name': u'Coca Cola'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/13' labels=set(['Manufacturer']) properties={'name': u'Pepsi'}>)"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from scripts.vis import draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-e2962739-78ba-413d-a165-c7daca1960a9.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f235aa24890>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-b836bd03-2d7a-4416-b779-42432fe737f7.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f235a744dd0>"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "AttributeError",
     "evalue": "'Record' object has no attribute 'drink'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-25-9832f1cbb172>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[1;32mfor\u001b[0m \u001b[0mrow\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mdata\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 2\u001b[1;33m     \u001b[1;32mprint\u001b[0m \u001b[1;34m\"{0} likes to drink {1}.\"\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mrow\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"name\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mrow\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdrink\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;31mAttributeError\u001b[0m: 'Record' object has no attribute 'drink'"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Parameterized Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## NetworkX Graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeMAAAFBCAYAAABEo8fdAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3XlU1XX+x/EXgiwXEQQXUkGlNDMVRBT3JXPLaqzGGgEB\njZpcRtPGrKacnBkz1zqaG5mmKNZU88ss13DXBDVAszRzMpdJS01UuC7A/f3R6OSgDVwufO6F5+Oc\nDna/fG+v6zmdF+8P38/362az2WwCAADGVDEdAACAyo4yBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDA\nMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEA\nMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMA\nAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoY\nAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwy\nBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDPEwHwM3Z\nbDbt3LlTi+fN07HDh5WXmyv/gABFdOyopKeeUv369U1HBAA4iJvNZrOZDoH/sNlsWrRwoWZNmqSL\nJ0/qCatVzQoL5SMpR9IGLy+lurmpe9euenbCBEVHR5uODAAoJcrYiVy5ckVDBg7UwbVrNTE3V/fq\n5r9HuCApRdLLPj6aPneuBiUklG9QAIBDUcZOorCwUIN++1udX7NG71qtshTjnC8l9bZYNGPRIg14\n9NGyjggAKCOUsZOYN2eOFo0dq015efIpwXnZknpYLNrz5Zdq0KBBWcUDAJQhrqZ2AjabTa+/8oqm\nlrCIJSlcUlx+vpJnzy6LaACAckAZO4GNGzfKIydHne08f+iVK3pr/nxdvnzZobkAAOWDMnYCC2fN\n0lMXL8rNzvPvlNTMZtOqVascGQsAUE4oYydw5NAhtSzle7S8fFlHjhxxRBwAQDmjjJ1Abl6efEv5\nHr5Xryo3N9cheQAA5YsydgL+1asrp5TvkePpqerVqzskDwCgfFHGTqB5VJS2eth/Z1KbpK1Vq6p5\n8+aOCwUAKDfsM3YC+/btU5/oaB2xWlXVjvO3SxpSt64OHD8uNzd7LwMDAJjCZOwEWrRoobAmTbTC\nzvNneXtr6DPPUMQA4KIoYyfx3MSJesZi0YkSnvcPSSsvX9bJH35Qfn5+WUQDAJQxythJ9OvXT0Of\ne049LRZ9V8xzPpT0lK+v/rF6tTIzM9WpUycdOnSoLGMCAMqA+8svv/yy6RD4WaeuXXXVy0uDt2/X\nlcJCNbHZVO0m37dH0kve3prp56eP09LUpUsXxcbG6tKlS4qPj1eNGjUUGRnJsjUAuAgu4HJCWVlZ\nmjN9ut57/331cnfXXbm5skg6V6WK0nx9dcrLS089/bQef/JJ1apV64Zzv/zyS8XGxio0NFRvvvmm\nateubeZDAACKjTJ2YufOndP777+vY0ePKu/8efnXrKlWrVqpT58+cnd3v+V5V65c0Z///GctXrxY\nycnJuv/++8sxNQCgpCjjCmzr1q2Kj49X7969NX36dPn6lvY+XwCAssAFXBVY586dlZWVJavVqlat\nWikjI8N0JADATTAZVxLvv/++hg8fruHDh+uFF16QRynu+AUAcCzKuBI5ceKEBg8erAsXLiglJUV3\n3HGH6UgAALFMXanUq1dPa9as0cCBA9W+fXstWLBA/CwGAOYxGVdS+/fvV1xcnEJDQ7VgwYIiW6QA\nAOWHybiSuvvuu5Wenq677rpL4eHh+uSTT0xHAoBKi8kY2rJli+Lj49W3b19NmzaNLVAAUM6YjKEu\nXbooOztbubm5ioyM1K5du0xHAoBKhckYN3jvvfc0YsQIjRgxQs8//zxboACgHFDGKOLEiRNKTExU\nbm6uUlJSdPvtt5uOBAAVGsvUKKJevXpau3atHnvsMbVr105vvfUWW6AAoAwxGeNX7d+/X7GxsWrU\nqJGSk5PZAgUAZYDJGL/q2haoJk2aKCIiQqtWrTIdCQAqHCZjFNvmzZuVkJCgfv36aerUqbJYLKYj\nAUCFwGSMYuvatauys7N1/vx5RUZGavfu3aYjAUCFwGQMu7z77rsaOXKkRo4cqXHjxrEFCgBKgTKG\n3Y4fP67ExERZrValpKQoLCzMdCQAcEksU8Nu9evX17p16zRgwABFR0dr4cKFbIECADswGcMhvvji\nC8XGxur2229XcnKyatasaToSALgMJmM4RPPmzZWRkaE77rhD4eHhWr16telIAOAymIzhcJs2bVJC\nQoLuv/9+tkABQDEwGcPhunXrpuzsbOXk5CgyMlJ79uwxHQkAnBqTMcrUO++8o5EjR2rUqFF67rnn\n5O7ubjoSADgdyhhl7tixY0pMTNTly5eVkpKiRo0amY4EAE6FZWqUuZCQEK1fv16PPPKI2rZtq0WL\nFrEFCgB+gckY5Wrfvn2KjY1V48aNNX/+fLZAAYCYjFHOWrRooV27diksLEzh4eFas2aN6UgAYByT\nMYzZuHGjEhMT9eCDD2ry5MlsgQJQaTEZw5ju3bsrOztbZ8+eVevWrfX555+bjgQARlDGMCogIEDL\nli3T+PHj1adPH02aNEkFBQWmYwFAuWKZGk7j2LFjSkhI0NWrV7VkyRK2QAGoNJiM4TRCQkL06aef\nqn///mrbtq0WL17MFigAlQKTMZzS3r17FRcXpyZNmmj+/PkKCgoyHQkAygyTMZxSy5YtlZGRoQYN\nGig8PFxr1641HQkAygyTMZzehg0blJiYqP79+2vy5Mny8fExHQkAHIrJGE7vnnvuUXZ2tk6fPs0W\nKAAVEmUMl1CjRg2lpqbqxRdfZAsUgAqHZWq4nKNHjyohIUH5+flKSUlRw4YNTUcCgFJhMobLCQ0N\nVVpamvr37682bdqwBQqAy2Myhkvbu3evYmNj1bRpU82bN48tUABcEpMxXFrLli21a9cuhYaGKjw8\nXOvWrTMdCQBKjMkYFUZaWpoGDx6shx56SK+++ipboAC4DCZjVBg9evRQdna2Tp06paioKGVmZpqO\nBADFQhmjQqlRo4aWL1+uF154Qb1799bkyZPZAgXA6bFMjQrr6NGjio+PV2FhoZYsWcIWKABOi8kY\nFda1LVAPPPCA2rZtq5SUFLZAAXBKTMaoFLKzsxUbG6tmzZpp3rx5CgwMNB0JAK5jMkalEB4ert27\nd6tevXoKDw/Xp59+ajoSAFzHZIxK59NPP9XgwYP1yCOPaNKkSWyBAmAckzEqnXvvvVfZ2dn6/vvv\nFRUVpaysLNORAFRylDEqpcDAQL3zzjt6/vnn1atXL02ZMoUtUACMYZkald53332n+Ph4SdKSJUvU\noEEDw4kAVDZMxqj0GjRooA0bNqhfv35q06aNli5dyhYoAOWKyRj4haysLMXGxqp58+aaO3cuW6AA\nlAsmY+AXIiIitHv3bt12221sgQJQbpiMgVtYv369Bg8erAEDBmjSpEny9vY2HQlABcVkDNxCz549\ntXfvXp04cUJRUVHKzs42HQlABUUZA78iMDBQ7777rsaNG6d7771XU6dOZQsUAIdjmRoopiNHjig+\nPl5VqlTRkiVLFBoaajoSgAqCyRgopoYNG2rjxo3q27evoqKitGzZMhUUFGj06NE6fPiw6XgAXBiT\nMWCHzMxMxcbGytPTU9nZ2apWrZpef/11DRkyRG5ubqbjAXAxlDFgp/T0dHXo0EGFhYXXX+vfv7+S\nk5NVq1Ytg8kAuBqWqQE7/f3vf7+hiCXpww8/VIsWLbRq1SpDqQC4IsoYsNO0adOUnJwsi8Vyw+un\nTp1Sv379NHz4cOXl5RlKB8CVsEwNlNKhQ4c0aNAgpaenFzl25513aunSpYqKijKQDICrYDIGSqlx\n48batm2bXn75Zbm7u99w7ODBg2rfvr0mTpyo/Px8QwkBODsmY8CB0tPTFRcXp2+++abIsQ4dOigl\nJUVhYWEGkgFwZkzGgANFR0crMzNTTz75ZJFjO3bsUHh4uBYuXMgjGgHcgMkYKCMfffSRkpKS9OOP\nPxY59tBDDyk5OVk1a9Y0kAyAs6GMgTJ06tQpJSUl6eOPPy5yLDg4WAsXLlTfvn0NJAPgTFimBspQ\nnTp19NFHH2nevHlFtkCdPHlS9913H1ugADAZA+Xl66+/1qBBg5SRkVHk2J133qlly5apdevWBpIB\nMI3JGCgnTZo00bZt2zR+/HhVqXLj/3oHDx5Uu3btNHHiRB7RCFRCTMaAATt37lRcXNxNn/bUsWNH\npaSkqFGjRgaSATCByRgwoF27dsrKylJSUlKRY9u3b1fLli21aNEitkABlQSTMWDYihUrlJSUpNOn\nTxc59vDDD2v+/Pk33QJ1/vx5rVixQsePH9clq1X+AQGKjIxU165deYwj4GIoY8AJnDx5Uo8//vhN\nn/YUHBysRYsWqU+fPpKk/fv3a/b06Vr+zjvq4u6uplarfAoKdM7TU+s9PWWrUUND//hHJSQmqnr1\n6uX9UQDYgTIGnITNZtP8+fM1ZswYWa3WIsdHjBihBvXra+qECXrqyhU9WVCgev/9HpK2SHrDYtGu\natW0auNGNWvWrDziAygFyhhwMgcPHlRcXJx27959w+vukuq7uWmTzaaGxXifJW5uetbPT5vS09W0\nadOyiArAQbiAC3Ayd955p3bs2KGXXnrphi1QNSTtKGYRS1K8zaZXL1zQfd26KTc3tyyiAnAQyhhw\nQlWrVtVf/vIXbdu2TWFhYaom6U1JdUv4Pok2m5pfvKjly5eXQUoAjsIyNeDktm7dqgH33KPj+fny\nsOP8tZKeu/12fX7oEFdZA06KyRhwckvffFN/sNnsKmJJ6inpwsmTN70NJwDnQBkDTm7v7t3qXopb\nZFaR1M1m0969ex0XCoBDUcaAk8s5f16l3S3sf/WqcnJyHJIHgONRxoCTs/j4qLQPWMz18CjyCEcA\nzoMyBpxcaKNG2l/K99jv4aGQkBCH5AHgeJQx4OQSR4zQfD8/u8/fL+kbNzf17t3bcaEAOBRlDDi5\nfv366XsvL+2x8/zXJF0qLNSOHTscGQuAA1HGgJNzd3fX8DFj9KzFoqslPDdLUqqkcxcv6p577tHz\nzz+vq1dL+i4Ayho3/QBcQH5+vh7q3Vt+O3bo7UuX5FmMc76S1EnS2f96vU2bNkpNTdUdd9zh+KAA\n7MJkDLgADw8PvbtypXI7dVIvi0U79PMTmm4mT9ICSd18fNS+b98id93atWuXIiIitGjRIvGzOOAc\nKGPARVgsFv1jzRo9PHGiEm+7Ta2qVdMcSWmSdkhaLWm0p6dCvb31Uffu+r9PP9XHq1Zp/fr1qlv3\nxrta5+bmasiQIfrd736nn376ycCnAfBLLFMDLqiwsFBpaWlaMneujh85IqvVqoCAAEV26qQnhw9X\nw4YNb/j+M2fOKCkpSR9++GGR9woJCdGyZcvUuXPnckoP4L9RxkAlYbPZ9Oabb+rpp5+W1Wq94ViV\nKlX0wgsvaPz48apataqhhEDlRRkDlcxXX32lmJgYZWVlFTkWHR2t1NRUhYWFGUgGVF78zhioZO66\n6y7t3LlTzzzzTJFj6enpioiI0NKlSw0kAyovJmOgElu3bp0SEhJ08uTJIsdiYmI0Z84c+fv7G0gG\nVC6UMVDJ/fjjj3r88ce1cuXKIscaNmyoZcuWqUOHDgaSAZUHy9RAJVerVi2tWLFCs2fPlre39w3H\njhw5os6dO2vChAnKz883lBCo+JiMAVy3f/9+DRw4UPv27StyrGPHjlq6dGmRbVMASo/JGMB1d999\ntzIyMjRq1Kgix7Zv367w8HAtX77cQDKgYmMyBnBTq1evVmJion744Ycix+Lj4/XGG2/IrxSPdgTw\nH5QxgFs6deqUBg8erNWrVxc5FhYWptTUVEVHRxtIBlQsLFMDuKU6derok08+0cyZM+Xl5XXDsX/+\n85/q2LGjJk6cqIKCAkMJgYqByRhAsezbt08DBw7U/v37ixzr0qWLUlJSFBoaaiAZ4PqYjAEUS4sW\nLbRr1y6NGDGiyLEtW7YoPDxcH3zwgYFkgOujjAEUm4+Pj2bNmqWVK1eqZs2aNxw7d+6cTpw4YSgZ\n4NooYwAldv/992vfvn3q1avX9dc8PT117tw5fn8M2IEyBmCX4OBgrV69WjNmzFBoaKgyMjK0efNm\ndevWTd99953peIBL4QIuAKV26dIleXt7q7CwUNOnT9fUqVM1a9YsPfbYY6ajAS6BMgbgcHv27NHA\ngQPVoUMHzZo1i5uDAP8Dy9QAHK5169b6/PPP5eHhoVatWikjI8N0JMCpMRkDKFMffPCBhg0bplGj\nRmncuHFyd3c3HQlwOpQxgDJ37NgxDRo0SJKUkpKikJAQw4kA58IyNYAyFxISorS0NPXu3VtRUVF6\n//33TUcCnAqTMYBylZGRoZiYGHXr1k2vv/66qlWrZjoSYByTMYBy1bZtW2VmZqqgoECRkZHas2eP\n6UiAcZQxgHLn5+enRYsW6a9//av69u2rKVOmqLCw0HQswBiWqQEY9d133ykuLk6enp5asmSJ6tWr\nZzoSUO6YjAEY1aBBA23atEndu3dX69at9eGHH5qOBJQ7JmMATuOzzz5TbGysevbsqRkzZsjX19d0\nJKBcMBkDcBrt27dXVlaW8vLyFBUVpczMTNORgHJBGQNwKtWrV1dKSopefPFF9erVSzNmzODiLlR4\nLFMDcFrffvutYmNj5efnp7ffflu33Xab6UhAmWAyBuC0GjVqpC1btqhdu3Zq1aqVVq5caToSUCaY\njAG4hG3btikuLk79+vXTtGnT5OPjYzoS4DBMxgBcQqdOnZSVlaWzZ88qKipKe/fuNR0JcBjKGIDL\nCAgIUGpqqsaNG6cePXpo5syZYnEPFQHL1ABc0uHDhxUTE6OgoCAtWrRIderUMR0JsBuTMQCXdPvt\nt2vbtm2KjIxUq1attGrVKtORALsxGQNweZs3b1Z8fLz69++vyZMny9vb23QkoESYjAG4vK5duyor\nK0vff/+92rZtqy+++MJ0JKBEKGMAFUKNGjX07rvvavTo0erevbtmz57NxV1wGSxTA6hwDh06pJiY\nGAUHB2vhwoWqVauW6UjAr2IyBlDhNG7cWNu3b9fdd9+tiIgIrVu3znQk4FcxGQOo0DZu3Kj4+Hg9\n+uijeuWVV+Tl5WU6ElAEkzGACq179+7KysrSt99+q3bt2umrr74yHQkogjIGUOEFBQXpgw8+0NCh\nQ9WlSxfNnz+fi7vgVFimBlCpHDhwQDExMQoNDdWCBQtUs2ZN05EAJmMAlUvTpk312WefqXHjxoqI\niFBaWprpSACTMYDKa/369Ro8eLBiYmL0t7/9TZ6enqYjoZJiMgZQafXs2VOZmZk6cOCAOnTooIMH\nD5qOhEqKMgZQqdWqVUsrVqzQ448/rk6dOmnBggVc3IVyxzI1APzbl19+qYEDB6px48ZKTk5WYGCg\n6UioJJiMAeDfmjVrpvT0dIWEhCgiIkKbNm0yHQmVBJMxANzEmjVrNGTIECUmJmrChAmqWrWq6Uio\nwJiMAeAm+vTpo6ysLGVnZ6tjx4765ptvTEdCBUYZA8At1K5dWx9//LEGDRqk9u3b6+233+biLpQJ\nlqkBoBj27dunmJgYNWvWTPPnz1dAQIDpSKhAmIwBoBhatGihjIwM1a5dWxEREdq6davpSKhAmIwB\noIQ++eQTJSUlKSkpSePHj+fiLpQaZQwAdjh58qQSExOVk5OjZcuWKSwszHQkuDCWqQHADsHBwVq1\napUee+wxRUdHa+nSpaYjwYUxGaNMXLlyRZK48T4qhezsbA0cOFCtWrXSnDlz5O/vbzoSXAyTMRzC\nZrNp8+bN+t0DD8jP21u+Pj7y9fGRn7e3Yn7zG23bto0tIaiwwsPDtXv3bvn7+ysiIkI7duwwHQku\nhskYpbZhwwaNHDJEhWfOaFhurgbabLp2R9/TklLd3DTHYpFX7dqavXixOnfubDIuUKZWrFih3//+\n9xo6dKj+9Kc/ycPDw3QkuADKGKWyfNkyPf3EE1poteo+SW63+D6bpI8kPeHjozmLF+u3AwaUX0ig\nnP3rX/9SQkKCrFarli5dqoYNG5qOBCfHMjXstm7dOo1+4gltsFrVT7cuYv372G8krbdaNSwhQRs3\nbiyfkIABdevW1dq1a9W/f3+1bdtWy5cvNx0JTo7JGHbJz89Xozp1lHL2rLqV8Nw1kobVqaNDJ07I\n3d29DNIBzuPzzz9XTEyMoqOj9cYbb8jPz890JDghJmPYZeXKlWpw9WqJi1iSeksKzM3V2rVrHZwK\ncD6RkZHas2ePvLy8FBERofT0dNOR4IQoY9hlzuTJGnbhgl3nukkadvGi5kyZ4thQgJPy9fVVcnKy\npk6dqgcffFATJ05UQUGB6VhwIixTo8RycnJUv1Ytnb56VV52vkeepEB3d61NS1PdunUVGBiogIAA\nlq1R4R0/flzx8fEqKChQSkqKQkNDTUeCE6CMUWKHDx9Wz4gI/fPixVK9Tw1J537x725ubgoICFBg\nYKCCgoJu+HqrPwcFBcnf319VqrDIA9dRUFCgadOmafr06Zo9e7YGsLug0qOMUWJff/21+rVurUOl\nLOMgSWcdkMfNzU01atQoUYEHBgaqevXqlDiM2rVrl2JiYtS5c2fNnDlT1apVMx0JhlDGKLEff/xR\nTUJCdPby5V/dzvRrCiT5SLrqwFwlVaVKletF/b+m8V++Vr16dbm52fvJgRtdvHhRo0aN0pYtW5Sa\nmqo2bdqYjgQDKGOUmM1mU3hYmF47ckQ97HyPTyQ9brEopFkznTlzRmfPnlVOTo4jY5YZd3d3BQYG\navny5erRw96/AeBG7733noYPH64xY8Zo7NixXD9RyVDGsMu8uXO1fuxYfZCba9f5/apV029nztTg\nwYOvv5afn6+ffvpJZ8+evV7Q177+2msX7Lyqu7QmTJigDh063DA5V6tWjakZdjt69KgGDRokd3d3\nLVmyRPXr1zcdCeWEMoZdLly4oAZ16mi31aqSPsX1gKROvr46+sMPslgspc5y9erV6+VckiK/WMrf\neffq1Uv5+fk3vO+VK1eK9fvq/37NYrFQ4pD088Vdr776qmbOnKm5c+fq4YcfNh0J5YAyht1mzpih\n5Jde0ra8PAUU85wzkjpaLHp6yhQ9NXx4Wcb7ny5fvqyffvrppqX9a6Wel5cn6eeHy9epU6fIe5bk\nva59LSgoKHGBBwYGysfHhxKvoHbu3KnY2Fj16NFDr732mnx9fU1HQhmijGE3m82msSNHat3Chfo4\nL0//a7fkEUn3WSx6aNgwTZw6tRwSlo1Lly7p7NmzCg4OdtjV2Far9YYfDIrzA8KZM2ckqcRXkV8r\ncTi/8+fP6w9/+IPS09OVmpqqyMhI05FQRihjlIrNZtP0yZP1twkT1N/NTcOsVrXRfx4aYZO0U9Ic\ni0UrCwv1l1de0cjRo80FrmCsVmuJCvza12sXoZXkKvKgoCB5edl7mxeUxvLlyzVq1Cg9++yzGjNm\nzC1/CMzOztbc117T9o0b9dOFC/L08FBw7doa+OSTik9IkL+/fzknR3FRxnCI06dPa+GCBZr32mty\ny81VsIeHbJJO5uerip+fho4Zo8QhQxQUFGQ6aqVns9mUl5dXoqX0a3+uWrVqiQs8MDBQnp6epj+2\nyzty5Iji4uLk4+OjxYsXq27dutePbdiwQeNHj9aRQ4f05JUreqCgQEGSrkg6LGmhxaJ1hYV67NFH\nNen111WjRg1THwO3QBnDoQoLC3XgwAGdPfvz7TwCAwPVtGlTbq5RAdhsNuXm5pbod+HXXvPy8ipx\ngQcGBqpq1aqmP7ZTyc/P18SJEzV37lwlJyfrwQcf1MIFC/TCyJGaabXqYUketzj3e0l/9fTUpuBg\nrdm6ldtwOhnKGECZstlsunDhQomW0q/9Y7FYSlzggYGB8vC4VSVVDDt27FBsbKwaN26sL7dt0war\nVU2Kee40d3e9Va+etmdmKjAwsExzovgoYwBOqbCwUBcuXCjxUvq5c+fk6+tbogIPCgpSQECAS5X4\nkSNH1PyOO7S1oECtSnjuSE9PXXz4YS1cvrxMsqHkKGMAFUphYaFycnJKvJSek5MjPz+/EhW4yaeN\nzZg6VVl//rOWWK0lPve0pMbe3vrm+HGu43ASlDEA6OebbVwr8ZLeAa569erl+rSxwsJC3VmvnlJO\nnlQ7Oz9vvI+PwidM0DNjx9r5DnAkyhgASqGgoOD6bVxLcoX6xYsX5e/vb9fTxjIyMpTUq5f2Xbhg\n98NatkgaFRamzMOHHfnXATtRxgBgQHHvxf7fx/Py8mSxWNQmN1dphYV2//f/JSmyenWddJEHtFR0\nrnO1AgBUIB4eHqpVq5Zq1apVovOuXr2qt956Sxv++EfJzge1SJK3pMtXTT7EFL/E5k8AcCFVq1ZV\ngwYNlFPKK79/khTA/a6dBmUMAC6mVatWyrh0SaVZYF7l5qa20dEOy4TSoYwBwMUEBwerd8+eWmLn\nE7ts+vl+8cO4ktppUMYA4IKGjR2rORaLCuw4d4OkKkFB6tKli6NjwU6UMQC4oM6dO6t+y5Ya7emp\nkmyJ+ZekIRaLJkybxrOwnQhlDAAuyM3NTe+tWqXNISF62tOzWBPyYUndLRYNfe45/XbAgLKOiBKg\njAHARQUEBGjz7t3aFxGhyGrVlCzp4k2+74CkUZ6eauvtracnT9ZzL71Uzknxv3DTDwBwcYWFhUpL\nS9OcKVO0Zds2dfX0VGB+vi5XqaJvq1TRYTc3JT31lJ4cPlwhISGm4+ImKGMAqECOHTumnTt36ty5\nc/L09FRwcLC6d+8uT09P09HwKyhjAAAM43fGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAY\nZQwAgGG//zrWAAAA6ElEQVSUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwA\ngGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkD\nAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHG\nAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGUMQAAhlHGAAAYRhkDAGAYZQwAgGGU\nMQAAhlHGAAAYRhkDAGDY/wPucW1qfLHYMAAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f234a6bca90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'9', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'10', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'11', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'8', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'})]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## igraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from igraph import Graph as IGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7fd41d3db240>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## graph3d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import graph3d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-00c5fe4a-6199-4937-8b4d-c61407981b2a\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-00c5fe4a-6199-4937-8b4d-c61407981b2a');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.027, -1.069, -1.093 ] },\n",
       "        \"3\": { \"location\": [ 0.134, 0.070, -0.109 ] },\n",
       "        \"4\": { \"location\": [ 1.105, 0.800, 1.267 ] },\n",
       "        \"5\": { \"location\": [ 1.997, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-8869c63d-f501-4e51-be9b-f16447f3e69a\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-8869c63d-f501-4e51-be9b-f16447f3e69a');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 8, \"target\": 10 },\n",
       "        { \"source\": 8, \"target\": 11 },\n",
       "        { \"source\": 9, \"target\": 10 },\n",
       "        { \"source\": 12, \"target\": 11 },\n",
       "        { \"source\": 13, \"target\": 10 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"8\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"9\": { \"location\": [ -1.665, -2.000, -2.000 ] },\n",
       "        \"10\": { \"location\": [ -0.929, -0.544, -0.691 ] },\n",
       "        \"11\": { \"location\": [ 1.018, 0.521, 0.897 ] },\n",
       "        \"12\": { \"location\": [ 1.861, 1.601, 1.744 ] },\n",
       "        \"13\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
