{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HTTP/1.1 200 OK\r",
      "\r\n",
      "Date: Sun, 15 Nov 2015 11:02:30 GMT\r",
      "\r\n",
      "Content-Type: application/json; charset=UTF-8\r",
      "\r\n",
      "Access-Control-Allow-Origin: *\r",
      "\r\n",
      "Content-Length: 730\r",
      "\r\n",
      "Server: Jetty(9.2.4.v20141103)\r",
      "\r\n",
      "\r",
      "\r\n",
      "{\r\n",
      "  \"extensions\" : { },\r\n",
      "  \"node\" : \"http://localhost:7474/db/data/node\",\r\n",
      "  \"node_index\" : \"http://localhost:7474/db/data/index/node\",\r\n",
      "  \"relationship_index\" : \"http://localhost:7474/db/data/index/relationship\",\r\n",
      "  \"extensions_info\" : \"http://localhost:7474/db/data/ext\",\r\n",
      "  \"relationship_types\" : \"http://localhost:7474/db/data/relationship/types\",\r\n",
      "  \"batch\" : \"http://localhost:7474/db/data/batch\",\r\n",
      "  \"cypher\" : \"http://localhost:7474/db/data/cypher\",\r\n",
      "  \"indexes\" : \"http://localhost:7474/db/data/schema/index\",\r\n",
      "  \"constraints\" : \"http://localhost:7474/db/data/schema/constraint\",\r\n",
      "  \"transaction\" : \"http://localhost:7474/db/data/transaction\",\r\n",
      "  \"node_labels\" : \"http://localhost:7474/db/data/labels\",\r\n",
      "  \"neo4j_version\" : \"2.3.1\"\r\n",
      "}"
     ]
    }
   ],
   "source": [
    "!curl -i http://localhost:7474/db/data/."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(<Node graph=u'http://localhost:7474/db/data/' ref=u'node/13' labels=set(['Person']) properties={'age': 24, 'name': u'Nicole'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/14' labels=set(['Person']) properties={'age': 20, 'name': u'Drew'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/15' labels=set(['Drink']) properties={'calories': 9000, 'name': u'Mountain Dew'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/16' labels=set(['Drink']) properties={'calories': 0, 'name': u'Coke Zero'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/17' labels=set(['Manufacturer']) properties={'name': u'Coca Cola'}>,\n",
       " <Node graph=u'http://localhost:7474/db/data/' ref=u'node/18' labels=set(['Manufacturer']) properties={'name': u'Pepsi'}>)"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from scripts.vis import draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-5c02b3f4-e499-4fde-a598-182b4b75293e.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f68f5be4b90>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-623567f2-958c-4c82-9d84-82afac818678.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f68f5c1cf50>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-c4af5a16-3e65-425c-9db9-cc895e6545c6.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f68f5bba790>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw_query\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (n)-[r:MAKES]->(m)\n",
    "    RETURN n, r, m\n",
    "    \"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "draw_query(data, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[r:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Parameterized Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## NetworkX Graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeAAAAFBCAYAAACvlHzeAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHY1JREFUeJzt3XtYlHXC//HPwAByEjSRIsvwkPto+qzVpm5pioUHUDNK\nLfOnpUkHtSfs8jC72YDrYJpWZll2aasWaal5KEtbzTRTTNPaFNcK6WCxZoqCiMDM/P5oc7U8cBj4\nzgzv158w91wfrq7dt/c998xY3G63WwAAoFYFmB4AAEBdRIABADCAAAMAYAABBgDAAAIMAIABBBgA\nAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAA\nGECAAQAwgAADAGAAAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDA\nAAIMAIABBBgAAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAG\nEGAAAAywmh6AynO5XDp+/LhOnDihqKgohYeHy2KxmJ4FAKgEzoB9yP79+5X28MNqFBmpK2NjdX3L\nlmrcoIHiGzfW1ClTdOjQIdMTAQAVZHG73W7TI3Bhhw4d0n0DBmh7drbuczqVWlam+DN+v0PSnHr1\ntFzSXYMG6ZmXXlJwcLChtQCAiiDAXu6bb75R906dNPDwYT1eVqZ6F3jsEUnDQ0N1rG1bvf3BBwoL\nC6utmQCASiLAXuzo0aO6sX173f/dd3rU5arQMU5Jw+rVU2Hnzlr27rsKDAys2ZEAgCrhNWAvNmPq\nVHXIz69wfCUpUNK8khJ9t3WrVq9eXXPjAADVwhmwlzp16pSaNm6sjceP6w9VOP41SQs6dtS6rVs9\nPQ0A4AGcAXup5cuXq43LVaX4StIdkj777DPt37/fk7MAAB5CgL3Uqtde0z1FRVU+PkTSHU4nl6EB\nwEsRYC/186FDiqvmc8SVlupn3hsMAF6JAHspl8ul6n62leU/zwMA8D4E2Es1jInRv6v5HIeCgtQw\nJsYjewAAnkWAvVTPO+/UkoiIKh9fJmlpUJB69uzpuVEAAI8hwF5q0KBB2uZ260AVj18tKSA4mC9p\nAAAvRYC9VFhYmP7fsGF6Oiio0sc6Jc0MD9dNvXopMTFR/fr1U3Z2tudHAgCqjAB7sXF//atWRUdr\nYSXOYt2S0oKDFdS6tRYsWKDc3Fz16NFDAwcOVPfu3bV+/Xrx2SsAYB6fhOXl9u7dq1tvuknjjh3T\naJfrgv9iOiVpVEiIPr3qKv1j61Y1aNDg9O/KysqUlZWlzMxMRUVFyWazqU+fPgoI4N9gAGACAfYB\neXl5GpCUpKPffKMHi4s1zO1WwzN/L+mloCDNt1rVpWtXvfLGG4o4zw1cTqdTK1askMPh0KlTpzRx\n4kQNHDhQVqu1Nv4UAMB/EGAf4Xa7tW3bNr3w1FNa9c47igkKUnhAgI45nSqSNPTee/XAmDFq2bJl\nhZ9v3bp1cjgc+v777zV+/HgNHTpUISEhNfuHAAAkEWCfVFhYqPz8fJ04cUL169dXXFyc6tW70DcF\nX9hHH32kzMxM7d69W2PHjtXIkSPPewYNAPAMAozTdu3apalTp+qDDz7QqFGjNGrUKDVs2PDiBwIA\nKo07cHBa+/bttWTJEm3evFl5eXlq2bKlxo0bpx9//NH0NADwOwQYv9OqVSvNnz9fu3btUklJidq0\naaOHHnpIeXl5pqcBgN8gwDivK6+8UrNmzdK+ffsUHR2t6667TkOHDlVOTo7paQDg8wgwLqpx48Zy\nOBz6+uuv1apVK3Xt2lUpKSnasWOH6WkA4LMIMCosOjpaNptNBw4c0M0336z+/furR48e+vDDD/l0\nLQCoJO6CRpWVlpZq0aJFmjp1qho3biybzabevXvzBRAAUAEEGNXmdDq1dOlSORwOWSwW2Ww2paSk\nKDAw0PQ0APBaBBge43a7tWbNGk2ZMkWHDx/WhAkTdM899yg4ONj0NADwOgQYHud2u7Vp0yY5HA7l\n5OToscce04gRIxQWFmZ6GgB4DW7CgsdZLBbdfPPNWrt2rZYvX66NGzcqPj5eDodDBQUFpucBgFcg\nwKhR119/vZYvX64PPvhA+/btU/PmzWWz2XTo0CHT0wDAKAKMWtG6dWstXLhQO3bsUEFBgf7whz/o\nkUce0XfffWd6GgAYQYBRq+Lj4/XCCy9oz549CgkJ0R//+EcNHz5c+/fvNz0NAGoVAYYRl112maZN\nm6Yvv/xSTZs21U033aSBAwdq9+7dpqcBQK0gwDCqYcOGmjRpknJzc9WhQwclJSUpKSlJW7ZsMT0N\nAGoUb0OCVykpKdHChQv15JNPqkmTJrLZbEpMTOTTtQD4HQIMr1ReXq4lS5YoMzNTISEhstls6t+/\nvwICuGgDwD8QYHg1l8ul1atXa8qUKSosLNTEiRN11113KSgoyPQ0AKgWAgyf4Ha7tWHDhtNfizhu\n3Djde++9Cg0NNT0NAKqE63nwCRaLRd27d9f69eu1ePFirV27Vs2aNdO0adN0/Phx0/MAoNIIMHxO\nx44dtXLlSq1du1a7d+9Ws2bNNGnSJB0+fNj0NACoMAIMn9WuXTtlZWVp27Ztys/P19VXX620tDQd\nPHjQ9DQAuCgCDJ/XokULzZ07V59//rkkqW3btkpNTdXXX39teBkAnB8Bht9o0qSJZs6cqf379ys2\nNlYdOnTQ4MGD9c9//tP0NAD4HQIMv9OoUSNlZGQoNzdX7dq106233qp+/fopOzvb9DQAOI23IcHv\nnTx5UvPnz9e0adPUokUL2Ww2JSQk8OlaAIwiwKgzysrKlJWVpczMTEVHR8tmsyk5OZlP1wJgBAFG\nneN0OrVixQo5HA6VlpZq4sSJGjBggKxWq+lpAOoQAow6y+12a926dZoyZYoOHjyo8ePHa+jQoQoJ\nCTE9DUAdQIABSZs3b1ZmZqY+++wzjR07ViNHjlRERITpWQD8GC9+AZI6d+6sNWvW6O2339a2bdvU\nrFkzTZ48WUePHjU9DYCfIsDAGdq3b6833nhDmzdv1oEDB9SiRQuNHz9e+fn5pqcB8DMEGDiHVq1a\naf78+dq1a5dOnjyp1q1b6+GHH1ZeXp7paQD8BAEGLuDKK6/UrFmzlJOTo6ioKF133XUaOnSocnJy\nTE8D4OMIMFABsbGxp7+L+Oqrr1bXrl2VkpKinTt3mp4GwEcRYKASoqOj9Ze//EW5ubnq0qWLbrvt\nNvXo0UObNm0SbygAUBm8DQmohtLSUi1atEhTp05VbGysbDabevXqxcdcArgoAgx4gNPp1NKlS+Vw\nOGSxWGSz2ZSSkqLAwEDT0wB4KQIMeJDb7daaNWs0ZcoUHT58WBMmTNA999yj4OBg09MAeBleAwY8\nyGKxKCkpSVu2bNHLL7+sJUuWqEWLFpo1a5aKi4slSdOmTdPu3bsNLwVgGmfAQA375JNPlJmZqS1b\ntmjAgAGaPXu2JKl3796y2Wy68cYbDS8EYAIBBmrJnj17lJyc/LsP8+jSpYtsNpsSExO5eQuoQ7gE\nDdSS0NBQffvtt7/7+aZNm9SzZ09df/31WrZsmVwul4F1AGobAQZqSXx8vFatWqVOnTqd8/effvqp\n7rjjDrVp00YLFy5UWVlZLS8EUJu4BA3UMrfbrU2bNsnhcGjdunXnfVzTpk01btw43XvvvQoNDa3F\nhQBqAwEGDNqxY4ccDofeeuut8z4mNjZWaWlpeuCBB1S/fv1aXAegJhFgwAvs3btXU6dOVVZWlpxO\n5zkfEx0drdGjR2vMmDFq1KhRLS8E4GkEGPAiBw4c0PTp0zV//nydOnXqnI8JCwtTamqqxo4dq8sv\nv7yWFwLwFAIMeKEff/xRTz/9tObMmaOioqJzPiY4OFjDhg3TuHHj1Lx581peCKC6CDDgxY4cOaLZ\ns2fr2Wef1ZEjR875mICAAA0aNEgTJkxQ27ZtL/qcpaWlWrZsmd5fsUJHDh1SQGCgYuLi1P/uu5WY\nmKiAAN4cAdQGAgz4gKKiIs2dO1dPPfWUfvzxx/M+rm/fvrLZbOrQocPvfvfTTz/pmenTNe+ll9TG\n7dadhYVqLMkl6XtJCyIiVBgRoQcefVQPjRqlsLCwGvt7ABBgwKeUlJRo4cKFevLJJ5Wbm3vexyUk\nJMhmsykhIUEWi0X79u1T765ddevRo/q/0lL9zzmOcUvKlpQZGqp/N2+u1Rs2KCYmpqb+FKDOI8CA\nDyovL9eSJUuUmZmpPXv2nPdxN9xwg0aMGCH7+PGaXFCg+yrwP3e3JFtQkN5t2lSbdu7krU9ADSHA\ngA9zuVxavXq1HA6Htm/ffs7HhEtKlzS2Es/rlvRASIhO9O6tV5cv98BSAL9FgAE/4Ha7tWHDBjkc\nDm3YsOGs3zWR9K2kyn7Nw3FJTUNCtCc3V3FxcR5aCuBX3O4I+AGLxaLu3btr/fr12rp1q/r27StJ\nCpP0mCofX0mqL2mQpJfnzPHcUACncQYM+KktW7YosUsX/eByKaqKz/G5pKSGDfXdzz97choAcQYM\n+K3IyEg1i4iocnwlqa2k/IICvpkJqAEEGPBTRUVFCrdU5eLzf1kkhVut5/00LgBVR4ABPxUZGanC\nar7C5JJUVFamyMhIz4wCcBoBBvxU06ZN9UNpqQ5V4zm2S4oJD+cMGKgBBBjwU/Xr19ft/ftrfjU+\n2/kpSf8uKlJ8fLwyMjJ07Ngxzw0E6jjuggb82M6dO5XSpYu+Li5WYCWPPaxf3kN85pciRkdH69FH\nH9UjjzyiqKjq3N4FgAADfq57x47q8OmnclTiTmanpD6SPpBUco7fE2Kg+rgEDfi5xatX682YGE2x\nWlWRf22XSRoREqLC9u01MT1dDRo0+N1jCgoK9MQTT+iqq67S5MmTuTQNVAFnwEAd8MMPPyi5Wzdd\n/v33SisuVlf9/tOxyiWtkjQ9PFyNOnTQ6ytXKiIiQsePH9dzzz2nGTNm6OjRo+d8/ujoaKWlpWnM\nmDGcEQMVRICBOuLEiRNauGCBnp82Ta6ff9adRUWK0S+Xmw8GBiorJETxLVvqwXHjNGDAAFmt1rOO\nJ8SAZxFgoI5xu93avHmz1r33no7m5yvAalWjuDj1v/12tWvX7qLHVyTEDRo0UFpamkaPHk2IgfMg\nwACqpDIhHjNmDN8rDPwGAQZQLceOHdNzzz2nmTNnEmKgEggwAI/4NcQzZsxQQUHBOR9DiIH/IsAA\nPKqiIR47dqxGjx5NiFFnEWAANYIQAxdGgAHUqGPHjmnWrFmaOXMmIQbOQIAB1IqKhLhhw4YaO3as\nRo0aRYjh9wgwgFpVkRC/+OKLSk1NreVlQO3is6AB1KqoqCg9/vjjysvLU0ZGhqKjo8/6fVBQkGJi\nYsS5AfwdZ8AAjCooKNCsWbP09NNPq6CgQKmpqdq2bZusVqvsdruSkpJksfz2k6sB30eAAXiFgoIC\nvfzyyxozZoyCgoK0cuVK2e12BQUFEWL4JQIMwGu5XC5CDL9FgAF4PZfLpRUrVig9PZ0Qw28QYAA+\n48wQBwcHy263q3fv3oQYPokAA/A5hBj+gAAD8Fm/hthutyskJIQQw6cQYAA+z+Vy6a233lJ6ejoh\nhs8gwAD8xpkhrlevnux2u3r16kWI4ZUIMAC/82uI7Xa7QkNDCTG8EgEG4LdcLpeWL1+u9PR0Qgyv\nQ4AB+D1CDG9EgAHUGWeGOCwsTHa7XT179iTEMIIAA6hzCDG8AQEGUGe5XC4tW7ZM6enpCg8PJ8So\nVQQYQJ1HiGECAQaA/zgzxBEREbLb7erRowchRo0gwADwGy6XS0uXLlV6eroiIyMJMWoEAQaA8yDE\nqEkEGAAu4swQ169fX3a7XYmJiYQY1UKAAaCCCDE8iQADQCU5nU4tXbpUGRkZhBhVRoABoIp+DXF6\nerqioqIIMSqFAANANZ0Z4ujoaNntdt16662EGBdEgAHAQ5xOp958801lZGQQYlwUAQYADyPEqAgC\nDAA1hBDjQggwANSwX0Ocnp6uhg0bym6365ZbbiHEdRwBBoBa4nQ69cYbbygjI4MQgwADQG0jxJAI\nMAAYQ4jrNgIMAIadGeJLLrlEdrtd3bt3J8R+jgADgJdwOp1asmSJMjIy1KhRI0Ls5wgwAHgZQlw3\nEGAA8FJnhjgmJkZ2u10JCQmE2E8QYADwck6nU4sXL1ZGRoYaN25MiP0EAQYAH0GI/QsBBgAfQ4j9\nAwEGAB91ZohjY2Nlt9vVrVs3QuwjCDAA+Ljy8vLTIb700ksJsY8gwADgJwixbyHAAOBnCLFvIMAA\n4KfKy8v1+uuva/Lkybrssstkt9vVtWtXQuwlCDAA+DlC7J0IMADUEYTYuxBgAKhjfg1xRkaG4uLi\nTr9GXB0ul0sul0tWq9VDK/1fgOkBAIDaZbVaNWTIEOXk5Gj48OEaOXKkunbtqo0bN1bqeb744gs9\nPHy4YuvXV3BQkEKCgxUVGqr+t96q999/Xy6Xq2b+AD/BGTAA1HHl5eXKysrS5MmTdfnll5++NH0+\ne/fu1YNDhujLnBzdX1qqYU6nrtAvZ3RHJC2X9HxEhIojIzX9+ed1W//+tfOH+BgCDACQVLEQf/TR\nR0rp1UvpJ05ouNutoPM8l1vSRklDQkM1fsoUjX700Zod74MIMADgLOXl5Xrttdc0efJkNWnS5HSI\n9+7dq24dOmhRUZESK/hc30jqEhamzJde0t333FOTs30OAQYAnNOZIb7iiit0/OBBjfzqK6VWMhtf\nSOoSGqq8/HzVr1+/Zsb6IG7CAgCck9Vq1dChQ7Vv3z7dcsstyvvqK91XhXO2ayTdEhCgVxct8vxI\nH0aAAQAXZLVa9UNurkYFBJz3Nd+LeejECb0wfbq46PpfXIIGAFxUbP362lZYqPgqHu+WFB8erjXb\nt6t169aenOazOAMGAFyQy+XS4aIiXVGN57BIusJq1U8//eSpWT6PAAMALujXD9SobjCC9MuNXfgF\nAQYAXJDValV4cLCOVvN5DrvdatCggUc2+QMCDAC4qG433qjl1Tj+X5L+7XarTZs2nprk8wgwAOCi\nHho3Ti9ERKiqd+2+GBys4ampCgkJ8eguX8Zd0ACAi3K5XLr68ss1Lz9fN1fy2AJJLerV0859+9S0\nadOamOeTOAMGAFxUQECAps2ercGhofq2EseVSkoJC9OQYcOI728QYABAhdyekqIHJ0zQnywW7anA\n4wsk9QoLU8OuXfXU7Nk1Pc/nEGAAQIWcOnVKa//xD93Qq5c6h4ZqUFiYPpR+97rwfklpwcFqUa+e\n2g4ZosWrVikwMNDAYu9mNT0AAOD93G63Ro4cqUaNGmnp0qUqLCzUooUL9eD06So5ckRNrFYF6Ze3\nGuW73RqemqodDz+sq666yvR0r8VNWACAi3I4HFq2bJk2bdqk8PDw0z93u93au3evfvrpJ5WXl6tB\ngwa65ppruNu5AggwAOCC3nzzTaWlpSk7O1txcXGm5/gNAgwAOK/t27crKSlJ69atU/v27U3P8Svc\nhAUAOKdvv/1W/fv317x584hvDSDAAIDfKSwsVHJystLS0tS3b1/Tc/wSl6ABAGdxOp3q16+f4uLi\n9NJLL8lisZie5Jc4AwYAnGXs2LEqKSnR888/T3xrEO8DBgCcNmfOHL333nvaunWrgoKCTM/xa1yC\nBgBIktauXauhQ4dqy5Ytat68uek5fo8AAwC0Z88edevWTcuWLVPnzp1Nz6kTeA0YAOq4Q4cOqU+f\nPnrqqaeIby3iDBgA6rCSkhIlJCQoISFBf/vb30zPqVMIMADUUW63W4MHD1Z5ebkWL16sgAAuitYm\n7oIGgDoqIyNDX3/9tTZu3Eh8DSDAAFAHvf7663rllVe0bds2hYaGmp5TJ3EJGgDqmI8//lj9+vXT\n+vXr1a5dO9Nz6iyuOQBAHXLgwAGlpKRowYIFxNcwAgwAdcSxY8eUnJysiRMnqnfv3qbn1HlcggaA\nOqC8vFxJSUlq0aKFZs+ezWc8ewHOgAHAz7ndbj3yyCOyWCx69tlnia+X4C5oAPBzzz33nDZu3KiP\nP/5YViv/t+8tuAQNAH7snXfe0YgRI/Txxx8rPj7e9BycgQADgJ/6/PPP1b17d61atUqdOnUyPQe/\nwWvAAOCH8vPz1adPH82aNYv4eikCDAB+5uTJk+rXr5/uu+8+3XXXXabn4Dy4BA0AfsTlcmnQoEEK\nCgrSq6++yh3PXozb4QDAj0yaNEkHDx7U+vXria+XI8AA4CcWLlyorKwsbdu2TfXq1TM9BxfBJWgA\n8AObN29WSkqKNm7cqNatW5uegwrgJiwA8HFfffWV7rzzTr366qvE14cQYADwYUePHlVycrKeeOIJ\nJSYmmp6DSuASNAD4qLKyMvXs2VNt27bVM888Y3oOKokAA4APcrvdSk1N1Q8//KCVK1cqMDDQ9CRU\nEndBA4APmjlzprKzs/XRRx8RXx9FgAHAx6xcuVIzZ87U1q1bFRkZaXoOqohL0ADgQ3bt2qXExES9\n8847uuGGG0zPQTVwFzQA+IiDBw+qb9++mjNnDvH1AwQYALzYyZMntXLlSp04cUJ9+/bVgw8+qDvu\nuMP0LHgAl6ABwEu53W7dfffdWrx4sVq2bKlOnTrp73//O5/x7Cc4AwYAL2W327V48WJJ0pdffqlj\nx46puLjY8Cp4CgEGAC/02muvKSMj46yf/etf/1JZWZmhRfA0LkEDgJfZsmWLEhISVFpaevpnjRo1\nUnZ2tpo1a2ZwGTyJM2AA8CK5ubm67bbbzopvcHCwVqxYQXz9DAEGAC9RUFCg5ORkHT58+Kyfz58/\nXzfeeKOhVagpBBgAvEBZWZkGDBignJycs37++OOPa/DgwYZWoSbxGjAA1ILDhw9ryZIl+i4vT8XH\njysqJkbtr71Wffr0kdVq1UMPPaQXX3zxrGMGDhyo119/nbcd+SkCDAA16JNPPtHsadO06u23lWyx\nqPXJkwqVdEzShshIfRUYqP/905/07vvvn3Vcx44dtWHDBoWGhhrZjZpHgAGgBrjdbk3PzNSzU6bo\n0ZIS3ety6ZJzPO4LSTMlLZZ08j8/a9q0qbKzsxUbG1tre1H7CDAA1IDJkybpjRkz9G5xsZpU4PFr\nJN0hyRIWpuzsbF1zzTU1vBCmcRMWAHjY6tWrNX/GDL1fwfhKUm9JSySFWSyKi4urwXXwFgQYADzs\nyb/+VTOKi3VpJY/rI6mny6VX5s2riVnwMlyCBgAP+uyzz5T85z/rQHGxrFU4fqukIZdeqv0HDyog\ngHMkf8Z/XQDwoLnPPquRp05VKb6S1FFSZFGR1q9f78lZ8EIEGAA8aM+nn+omp7PKx1sk3VRWpr17\n93puFLwSAQYADzpeWKjIaj5HVGmpjh8/7pE98F4EGAA8KDw8XCeq+RxFQUEKDw/3yB54LwIMAB7U\nrFUrfVbNj47cHRKi+Ph4Dy2Ct+IuaADwoE2bNumBpCTtKSpSVTKcIykhKkrfHDqk4OBgT8+DF+EM\nGAA8qHPnzgq45BJ9WMXj5wQHa8QDDxDfOoAAA4AHWSwW/Z/NpsfCwir9WvBOSVlWq0Y+/HBNTIOX\nIcAA4GHD779f1yQn6/bQUBVV8JjPJfUNDdXcRYt0xRVX1OQ8eAkCDAAeZrFY9PKrr6pJ//66KTxc\nqySd753BBZKesVh0S1iYZsybp9tvv70Wl8IkbsICgBridruVlZWl5xwO/ZiXpxElJWrtcilMv3wf\n8Pp69bRUUq/ERD32xBO69tprDS9GbSLAAFALdu7cqQVz5+q7L79UcXGxohs00P/++c+67/77deml\nlf3aBvgDAgwAgAG8BgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAAAQYAwAACDACA\nAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMIMAAABhBgAAAM\nIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAA\nAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMI\nMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGPD/\nAenORJfEoZuPAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f68dbec5ad0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'13', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'15', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'14', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'16', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'})]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## igraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from igraph import Graph as IGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7f68dbf7a718>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## graph3d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import graph3d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-7f24d88e-5ecd-4d9a-afbd-1a904e7ec162\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-7f24d88e-5ecd-4d9a-afbd-1a904e7ec162');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.361, -0.851, -0.953 ] },\n",
       "        \"3\": { \"location\": [ -0.014, 0.212, -0.214 ] },\n",
       "        \"4\": { \"location\": [ 1.247, 1.120, 1.133 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 1.978, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-89255085-20ce-4e6a-806d-425b473c831f\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-89255085-20ce-4e6a-806d-425b473c831f');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 13, \"target\": 15 },\n",
       "        { \"source\": 13, \"target\": 16 },\n",
       "        { \"source\": 14, \"target\": 15 },\n",
       "        { \"source\": 17, \"target\": 16 },\n",
       "        { \"source\": 18, \"target\": 15 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"13\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"14\": { \"location\": [ -1.699, -1.205, -1.586 ] },\n",
       "        \"15\": { \"location\": [ -0.429, -0.774, -0.162 ] },\n",
       "        \"16\": { \"location\": [ 0.620, 0.261, 0.177 ] },\n",
       "        \"17\": { \"location\": [ 1.443, 1.941, 1.752 ] },\n",
       "        \"18\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
